## Execute with: brew bundle install --zap --clean

cask_args appdir: "/Applications"

# local
brew "fzf"
brew "zsh-autosuggestions"
brew "thefuck"
brew "curl"
cask "iterm2"
brew "git"
brew "powerlevel10k"
brew "direnv"

brew "just"

# Testing sdkman
#cask "temurin21"

brew "gradle"
brew "pyenv"

# Work
brew "kubernetes-cli"
brew "kubectx"
brew "k9s"
brew "awscli"
brew "tfenv"
cask "gcloud-cli"


#cask "docker"
cask "jetbrains-toolbox"

# personal
cask "alfred"
cask "raycast"
cask "spotify"
cask "sublime-text"
cask "telegram"
cask "whatsapp"
cask "anki"
cask "hazeover"
cask "tomighty"
cask "arc"
cask "vlc"
cask "1password"
cask "chatgpt"
#cask "expressvpn"

# to test
#brew "gpg"
#brew "gnupg"
#brew "pinentry-mac"

#brew "jq"
#brew "yq"

#brew "bat"
#brew "fd"
#brew "httpie"
#brew "dive"
#brew "lastpass-cli"
#brew "neovim"
#brew "direnv"

