tap "homebrew/bundle"
tap "homebrew/cask-versions"

# local
brew "direnv"
brew "fzf"
brew "zsh-autosuggestions"
brew "thefuck"
brew "openconnect"
brew "curl"

brew "gpg"
brew "gnupg"
brew "pinentry-mac"


cask "temurin21"

brew "pyenv"
brew "pipenv"
brew "pipx"

cask "wezterm"
cask "iterm2"

# work - needed for running brew bundle install --clean
brew "awscli"
brew "fzf"
brew "git"
brew "jq"
brew "just"
brew "kubectx"
brew "sops"
brew "yq"
brew "stern"
brew "terraform"

## testing
brew "bat"
brew "fd"
brew "httpie"
brew "trivy"
brew "dive"
brew "zellij"
brew "k9s"

cask_args appdir: "/Applications"

cask "docker"
cask "jetbrains-toolbox"
cask "tuple"
cask "postman"


# personal
cask "alfred"
cask "spotify"
cask "sublime-text"
cask "todoist"
cask "telegram"
cask "anki"
cask "hazeover"
cask "tomighty"
cask "firefox"
cask "expressvpn"
