## Execute with:
## brew bundle install --zap --clean

tap "homebrew/bundle"

# local
brew "direnv"
brew "fzf"
brew "zsh-autosuggestions"
brew "thefuck"
brew "curl"

# to replace with a jdk manager
#cask "temurin21"

cask "iterm2"

brew "gradle"

brew "fzf"
brew "git"

brew "just"

cask_args appdir: "/Applications"

cask "docker"
cask "jetbrains-toolbox"

# personal
cask "alfred"
cask "raycast"
cask "spotify"
cask "sublime-text"
cask "todoist"
cask "telegram"
cask "anki"
cask "hazeover"
cask "tomighty"
cask "arc"
cask "vlc"

# to test
#brew "gpg"
#brew "gnupg"
#brew "pinentry-mac"

#brew "pyenv"

#brew "jq"
#brew "yq"

#brew "bat"
#brew "fd"
#brew "httpie"
#brew "dive"
#brew "lastpass-cli"
#brew "neovim"

